using System.Collections.Generic;

namespace PastriesDelivery
{
    public class RegexPatterns : IRegexPatterns
    {
        public List<string> Addresses { get; }
        public List<string> PhoneNumbers { get; }

        public RegexPatterns()
        {
            Addresses = new List<string> { @"улица\s[А-Я][а-я]*\,\sд\.\s\d{2}\,\sкв\.\s\d{2}",    // улица Серебряная, д. 23, кв. 89
                                           @"улица\s[А-Я][а-я]*\sд\.\d{2}\,\sкв\.\d{2}",          // улица Серебряная д.23, кв.89
                                           @"ул\.[А-Я][а-я]*\sд\.\d{2}\,кв\.\d{2}",               // ул.Серебряная д.23,кв.89
                                           @"ул\.[А-Я][а-я]*\sд\.\d{2}",                          // ул.Серебряная д.23
                                           @"ул\.[А-Я][а-я]*\sдом\s\d{2}\,\sквартира\s\d{2}",     // ул.Серебряная дом 23, квартира 45
                                           @"ул\.[А-Я][а-я]*\.\sдом\s\d{2}\,\sквартира\s\d{2}",   // ул.Серебр. дом 23, квартира 45
                                           @"ул\.\s[А-Я][а-я]*\.\sд\.\d{2}",                      // ул. Серебр. д.23
                                           @"ул\.\s[А-Я][а-я]*\.\sд\.\d{2}\,кв\.\d{2}",           // ул. Серебр. д.23,кв.89
                                           @"ул\.\s[А-Я][а-я]*\s[А-Я][а-я]*\sд\.\d{2}\,кв\.\d{2}" // ул. Бориса Мозолевского д.23,кв.89
            };

            PhoneNumbers = new List<string> { @"\+380\(\d{2}\)\d{3}\s*\d{2}\s*\d{2}" ,         // +380(95)222 33 88
                                              @"\+380\d{2}\d{3}\s*\d{2}\s*\d{2}",              // +380952223388
                                              @"0\d{9}",                                       // 0952223388
                                              @"0\d{2}\s*\d{3}\s*\d{2}\s*\d{2}"                // 095 222 33 88
            };
        }
    }
}